Repository: 84000/data-translation-memory
Catalog: toh317_84000-distinctly-ascertaining-the-meanings.tmx
Source language: bo
Languages: en

source: ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་པ་དང་། དབུགས་རིང་དུ་བརྔུབས་ན་དབུགས་རིང་དུ་བརྔུབས་སོ་སྙམ་དུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་པ་དང་། དབུགས་རིང་དུ་ཕྱུང་ན་ཡང་དབུགས་རིང་དུ་ཕྱུང་ངོ་སྙམ་དུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་པ་དང་། དབུགས་ཐུང་ངུ་བརྔུབས་ན་དབུགས་ཐུང་ངུ་བརྔུབས་སོ་སྙམ་དུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་པ་དང་། དབུགས་ཐུང་ངུ་ཕྱུང་ན་དབུགས་ཐུང་ངུ་ཕྱུང་ངོ་སྙམ་དུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་པ་དང་། ལུས་ཀྱི་འདུ་བྱེད་ཡང་དག་པར་མྱོང་ཞིང་དབུགས་བརྔུབས་ན་ལུས་ཀྱི་འདུ་བྱེད་ཡང་དག་པར་མྱོང་ཞིང་དབུགས་བརྔུབས་སོ་སྙམ་དུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་པ་དང་། ལུས་ཀྱི་འདུ་བྱེད་ཡང་དག་པར་མྱོང་ཞིང་དབུགས་ཕྱུང་ན་ལུས་ཀྱི་འདུ་བྱེད་ཡང་དག་པར་མྱོང་ཞིང་དབུགས་ཕྱུང་ངོ་སྙམ་དུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་པ་དང་། ལུས་ཀྱི་ཐམས་ཅད་ཡང་དག་པར་མྱོང་ཞིང་དབུགས་བརྔུབས་ན་ལུས་ཀྱི་ཐམས་ཅད་ཡང་དག་པར་མྱོང་ཞིང་དབུགས་བརྔུབས་སོ་སྙམ་དུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་པ་དང་། ལུས་ཀྱི་ཐམས་ཅད་ཡང་དག་པར་མྱོང་ཞིང་དབུགས་ཕྱུང་ན་ལུས་ཀྱི་ཐམས་ཅད་ཡང་དག་པར་མྱོང་ཞིང་དབུགས་ཕྱུང་ངོ་སྙམ་དུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་པ་དང་། ལུས་ཀྱི་འདུ་བྱེད་ཐམས་ཅད་ཡང་དག་པར་མྱོང་ཞིང་དབུགས་བརྔུབས་ན་ལུས་ཀྱི་འདུ་བྱེད་ཐམས་ཅད་ཡང་དག་པར་མྱོང་ཞིང་དབུགས་བརྔུབས་སོ་སྙམ་དུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་པ་དང་། ལུས་ཀྱི་འདུ་བྱེད་ཐམས་ཅད་ཡང་དག་པར་མྱོང་ཞིང་དབུགས་ཕྱུང་ན་ལུས་ཀྱི་འདུ་བྱེད་ཐམས་ཅད་ཡང་དག་པར་མྱོང་ཞིང་དབུགས་ཕྱུང་ངོ་སྙམ་དུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་པ་དང་། བདག་གི་ལུས་ཀྱི་འདུ་བྱེད་ཤིན་ཏུ་སྦྱངས་ནས་དབུགས་བརྔུབས་ན་བདག་གི་ལུས་ཀྱི་འདུ་བྱེད་ཤིན་ཏུ་སྦྱངས་ནས་དབུགས་བརྔུབས་སོ་སྙམ་དུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་པ་དང་། བདག་གི་ལུས་ཀྱི་འདུ་བྱེད་ཤིན་ཏུ་སྦྱངས་ནས་དབུགས་ཕྱུང་ན་བདག་གི་ལུས་ཀྱི་འདུ་བྱེད་ཤིན་ཏུ་སྦྱངས་ནས་དབུགས་ཕྱུང་ངོ་སྙམ་དུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་པ་དང་། དགའ་བ་ཡང་དག་པར་མྱོང་ཞིང་དབུགས་བརྔུབས་ན་དགའ་བ་ཡང་དག་པར་མྱོང་ཞིང་དབུགས་བརྔུབས་སོ་སྙམ་དུ།
en: “Breathing in a short breath, one is perfectly aware, as it is, that ‘I am breathing in a short breath.’ Breathing out a short breath, one is perfectly aware, as it is, that ‘I am breathing out a short breath.’ 4. “Experiencing the assembled factors of the body as one breathes in, one is perfectly aware, as it is, that ‘Experiencing the assembled factors of the body, I am breathing in.’ Experiencing the assembled factors of the body as one breathes out, one is perfectly aware, as it is, that ‘Experiencing the assembled factors of the body, I am breathing out.’ 5. “Experiencing the entirety of the body as one breathes in, one is perfectly aware, as it is, that ‘Experiencing the entirety of the body, I am breathing in.’ Experiencing the entirety of the body as one breathes out, one is perfectly aware, as it is, that ‘Experiencing the entirety of the body, I am breathing out.’ 6. “Experiencing all the assembled factors of the body as one breathes in, one is perfectly aware, as it is, that ‘Experiencing all the assembled factors of the body, I am breathing in.’ Experiencing all the assembled factors of the body as one breathes out, one is perfectly aware, as it is, that ‘Experiencing all the assembled factors of the body, I am breathing out.’ 7. “Placing at ease the assembled factors of the body as one breathes in, one is perfectly aware, as it is, that ‘Placing at ease the assembled factors of the body, I am breathing in.’ Placing at ease the assembled factors of the body as one breathes out, one is perfectly aware, as it is, that ‘Placing at ease the assembled factors of the body, I am breathing out.’

source: ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་པ་དང་། དགའ་བ་ཡང་དག་པར་མྱོང་ཞིང་དབུགས་ཕྱུང་ན་དགའ་བ་ཡང་དག་པར་མྱོང་ཞིང་དབུགས་ཕྱུང་ངོ་སྙམ་དུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་པ་དང་། བདེ་བ་ཡང་དག་པར་མྱོང་ཞིང་དབུགས་བརྔུབས་ན་བདེ་བ་ཡང་དག་པར་མྱོང་ཞིང་དབུགས་བརྔུབས་སོ་སྙམ་དུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་པ་དང་། བདེ་བ་ཡང་དག་པར་མྱོང་ཞིང་དབུགས་ཕྱུང་ན་བདེ་བ་ཡང་དག་པར་མྱོང་ཞིང་དབུགས་ཕྱུང་ངོ་སྙམ་དུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་པ་དང་། སེམས་ཡང་དག་པར་མྱོང་ཞིང་དབུགས་བརྔུབས་ན་སེམས་ཡང་དག་པར་མྱོང་ཞིང་དབུགས་བརྔུབས་སོ་སྙམ་དུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་པ་དང་། སེམས་ཡང་དག་པར་མྱོང་ཞིང་དབུགས་ཕྱུང་ན་སེམས་ཡང་དག་པར་མྱོང་ཞིང་དབུགས་ཕྱུང་ངོ་སྙམ་དུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་པ་དང་། སེམས་ཀྱི་འདུ་བྱེད་ཡང་དག་པར་མྱོང་ཞིང་དབུགས་བརྔུབས་ན་སེམས་ཀྱི་འདུ་བྱེད་ཡང་དག་པར་མྱོང་ཞིང་དབུགས་བརྔུབས་སོ་སྙམ་དུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་པ་དང་། སེམས་ཀྱི་འདུ་བྱེད་ཡང་དག་པར་མྱོང་ཞིང་དབུགས་ཕྱུང་ན་སེམས་ཀྱི་འདུ་བྱེད་ཡང་དག་པར་མྱོང་ཞིང་དབུགས་ཕྱུང་ངོ་སྙམ་དུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་པ་དང་། བདག་གི་སེམས་ཀྱི་འདུ་བྱེད་ཤིན་ཏུ་སྦྱངས་ནས་དབུགས་བརྔུབས་ན་བདག་གི་སེམས་ཀྱི་འདུ་བྱེད་ཤིན་ཏུ་སྦྱངས་ནས་དབུགས་བརྔུབས་སོ་སྙམ་དུ།
en: “Experiencing joy as one breathes in, one is perfectly aware, as it is, that ‘Experiencing joy, I am breathing in.’ Experiencing joy as one breathes out, one is perfectly aware, as it is, that ‘Experiencing joy, I am breathing out.’ 9. “Experiencing pleasure as one breathes in, one is perfectly aware, as it is, that ‘Experiencing pleasure, I am breathing in.’ Experiencing pleasure as one breathes out, one is perfectly aware, as it is, that ‘Experiencing pleasure, I am breathing out.’ 10. “Experiencing the mind as one breathes in, one is perfectly aware, as it is, that ‘Experiencing the mind, I am breathing in.’ Experiencing the mind as one breathes out, one is perfectly aware, as it is, that ‘Experiencing the mind, I am breathing out.’

source: ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་པ་དང་། བདག་གི་སེམས་ཀྱི་འདུ་བྱེད་ཤིན་ཏུ་སྦྱངས་ནས་དབུགས་ཕྱུང་ན་བདག་གི་སེམས་ཀྱི་འདུ་བྱེད་ཤིན་ཏུ་སྦྱངས་ནས་དབུགས་ཕྱུང་ངོ་སྙམ་དུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་པ་དང་། བདག་གི་སེམས་མངོན་པར་མཆོག་ཏུ་དགའ་བར་བྱེད་ཅིང་དབུགས་བརྔུབས་ན་བདག་གི་སེམས་མངོན་པར་མཆོག་ཏུ་དགའ་བར་བྱེད་ཅིང་དབུགས་བརྔུབས་སོ་སྙམ་དུ།
en: “Experiencing the assembled factors of the mind as one breathes in, one is perfectly aware, as it is, that ‘Experiencing the assembled factors of the mind, I am breathing in.’ Experiencing the assembled factors of the mind as one breathes out, one is perfectly aware, as it is, that ‘Experiencing the assembled factors of the mind, I am breathing out.’ . “Placing at ease the assembled factors of the mind as one breathes in, one is perfectly aware, as it is, that ‘Placing at ease the assembled factors of the mind, I am breathing in.’ Placing at ease the assembled factors of the mind as one breathes out, one is perfectly aware, as it is, that ‘Placing at ease the assembled factors of the mind, I am breathing out.’

source: ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་པ་དང་། བདག་གི་སེམས་མངོན་པར་མཆོག་ཏུ་དགའ་བར་བྱེད་ཅིང་དབུགས་ཕྱུང་ན་བདག་གི་སེམས་མངོན་པར་མཆོག་ཏུ་དགའ་བར་བྱེད་ཅིང་དབུགས་ཕྱུང་ངོ་སྙམ་དུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་པ་དང་། བདག་གི་སེམས་རྣམ་པར་གྲོལ་བར་བྱེད་ཅིང་དབུགས་བརྔུབས་ན་བདག་གི་སེམས་རྣམ་པར་གྲོལ་བར་བྱེད་ཅིང་དབུགས་བརྔུབས་སོ་སྙམ་དུ།
en: “Gladdening one’s mind as one breathes in, one is perfectly aware, as it is, that ‘Gladdening the mind, I am breathing in.’ Gladdening one’s mind as one breathes out, one is perfectly aware, as it is, that ‘Gladdening the mind, I am breathing out.’

source: ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་པ་དང་། བདག་གི་སེམས་རྣམ་པར་གྲོལ་བར་བྱེད་ཅིང་དབུགས་ཕྱུང་ན་བདག་གི་སེམས་རྣམ་པར་གྲོལ་བར་བྱེད་ཅིང་དབུགས་ཕྱུང་ངོ་སྙམ་དུ།
en: “Liberating one’s mind as one breathes in, one is perfectly aware, as it is, that ‘Liberating the mind, I am breathing in.’ Liberating one’s mind as one breathes out, one is perfectly aware, as it is, that ‘Liberating the mind, I am breathing out.’

source: ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་པ་དང་། བདག་གི་སེམས་མཉམ་པར་བཞག་ཅིང་དབུགས་བརྔུབས་ན་བདག་གི་སེམས་མཉམ་པར་བཞག་ཅིང་དབུགས་བརྔུབས་སོ་སྙམ་དུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་པ་དང་། བདག་གི་སེམས་མཉམ་པར་བཞག་ཅིང་དབུགས་ཕྱུང་ན་བདག་གི་སེམས་མཉམ་པར་བཞག་ཅིང་དབུགས་ཕྱུང་ངོ་སྙམ་དུ།
en: “Concentrating one’s mind as one breathes in, one is perfectly aware, as it is, that ‘Concentrating the mind, I am breathing in.’ Concentrating one’s mind as one breathes out, one is perfectly aware, as it is, that ‘Concentrating the mind, I am breathing out.’

source: ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་པ་དང་། དེ་བཞིན་དུ་མི་རྟག་པའི་རྗེས་སུ་ལྟ། འདོད་ཆགས་དང་བྲལ་བའི་རྗེས་སུ་ལྟ། འགོག་པའི་རྗེས་སུ་ལྟ། སོ་སོར་སྤངས་པའི་རྗེས་སུ་ལྟ་ཞིང་དབུགས་བརྔུབས་ན་སོ་སོར་སྤངས་པའི་རྗེས་སུ་ལྟ་ཞིང་དབུགས་བརྔུབས་སོ་སྙམ་དུ། ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་པ་དང་། སོ་སོར་སྤངས་པའི་རྗེས་སུ་ལྟ་ཞིང་དབུགས་ཕྱུང་ན་སོ་སོར་སྤངས་པའི་རྗེས་སུ་ལྟ་ཞིང་དབུགས་ཕྱུང་ངོ་སྙམ་དུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་པ་སྟེ།
en: “In the same way, having insight into impermanence, having insight into nonattraction, having insight into cessation, and having insight into letting go, as one breathes in, one is perfectly aware, as it is, that ‘Having insight into letting go, I am breathing in.’ Having insight into letting go, as one breathes out, one is perfectly aware, as it is, that ‘Having insight into letting go, I am breathing out.’

source: དགེ་སློང་དག་འདི་དག་ནི་དབུགས་རྔུབ་པ་དང་། འབྱུང་བ་དྲན་པ་རྣམ་པ་བཅུ་དྲུག་གོ།
en: “This, bhikṣus, is mindfulness of inhalation and exhalation with sixteen aspects.

source: །དེ་ལ་རྒྱུན་དུ་ཞུགས་པའི་ཡན་ལག་བཞི་གང་ཞེ་ན།
en: “Now, what are the four parts of entering the stream?

source: འདི་ལ་འཕགས་པ་ཉན་ཐོས་ནི་དེ་ལྟར་ཡང་བཅོམ་ལྡན་འདས་དེ་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས།
en: Here, a noble śrāvaka is intelligently well disposed toward the Buddha, thinking, ‘Thus indeed is the Bhagavat:

source: རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ།
en: he is the tathāgata, arhat, perfect and complete Buddha, endowed with knowledge and feet, the Sugata, the knower of the world, the unexcelled charioteer of persons to be tamed, the teacher of gods and humans, the Buddha, the Bhagavat.’

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་སོ་ཞེས་སངས་རྒྱས་ལ་ཤེས་ནས་དད་པ་དང་ལྡན་པ་ཡིན། བཅོམ་ལྡན་འདས་ཀྱི་ཆོས་ནི་ལེགས་པར་གསུངས་པ། ཡང་དག་པར་མཐོང་བ། ནད་མེད་པ། དུས་ཆད་པ་མེད་པ་ཉེ་བར་གཏོད་པ་འདི་མཐོང་བ་ལ་དོན་ཡོད་པ་མཁས་པ་རྣམས་ཀྱིས་རང་གིས་རིག་པར་བྱ་བ་སྟེ། འདི་ལྟ་སྟེ།
en: “He is intelligently well disposed toward the Dharma, thinking, ‘The Dharma of the Bhagavat has been well spoken, it is to be seen for oneself, it is free from fever, it is timeless, it is a guide, and it is to be seen here, to be experienced by the wise for themselves.

source: རྒྱགས་པ་མེད་པར་བྱེད་པ། སྲེད་པ་རབ་ཏུ་སེལ་བ། ཀུན་གཞི་ལེགས་པར་འཇོམས་པ། ལམ་གྱི་རྒྱུན་བཅད་པ། སྲེད་པ་ཟད་པ།
en: It is the abolition of conceit, the removal of thirst, the destruction of the dwelling, the cutting off of the continuum of the path, and the destruction of craving;

source: འདོད་ཆགས་དང་བྲལ་བ། འགོག་པ།
en: it is nonattraction, cessation, nirvāṇa.’

source: མྱ་ངན་ལས་འདས་པའོ་ཞེས་ཆོས་ལ་ཤེས་ནས་དད་པ་དང་ལྡན་པ་ཡིན། བཅོམ་ལྡན་འདས་ཀྱི་ཉན་ཐོས་ཀྱི་དགེ་འདུན་ནི་ལེགས་པར་ཞུགས་པ། རིགས་པ་ལ་ཞུགས་པ། དྲང་པོ་ལ་ཞུགས་པ། འཐུན་པར་ཞུགས་པ། ཆོས་ཀྱི་རྗེས་སུ་འཐུན་པའི་ཆོས་ལ་ཞུགས་པ། རྗེས་སུ་འཐུན་པའི་ཆོས་སྤྱོད་པ་སྟེ།
en: “He is intelligently well disposed toward the Saṅgha, thinking, ‘The Saṅgha of śrāvakas of the Bhagavat practices well, as they practice in the proper way, they practice upright, they practice suitably, they practice the Dharma that accords with the Dharma, and they act in accordance with the Dharma.

source: དགེ་འདུན་གྱི་ནང་ན་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱ་བའི་ཕྱིར་ཞུགས་པ་དག་ཀྱང་ཡོད།
en: “In the Saṅgha, there are those practicing to directly realize the result of entering the stream.

source: དགེ་འདུན་གྱི་ནང་ན་རྒྱུན་དུ་ཞུགས་པ་དག་ཀྱང་ཡོད།
en: In the Saṅgha, there are the stream enterers.

source: དགེ་འདུན་གྱི་ནང་ན་ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱ་བའི་ཕྱིར་ཞུགས་པ་དག་ཀྱང་ཡོད།
en: In the Saṅgha, there are those who practice to directly realize the result of the once-returners.

source: དགེ་འདུན་གྱི་ནང་ན་ལན་ཅིག་ཕྱིར་འོང་བ་དག་ཀྱང་ཡོད།
en: In the Saṅgha, there are the once-returners.

source: དགེ་འདུན་གྱི་ནང་ན་ཕྱིར་མི་འོང་བའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱ་བའི་ཕྱིར་ཞུགས་པ་དག་ཀྱང་ཡོད།
en: In the Saṅgha, there are those who practice to directly realize the result of the non-returners.

source: དགེ་འདུན་གྱི་ནང་ན་ཕྱིར་མི་འོང་བ་དག་ཀྱང་ཡོད།
en: In the Saṅgha, there are the non-returners.

source: དགེ་འདུན་གྱི་ནང་ན་དགྲ་བཅོམ་པ་ཉིད་ཀྱི་འབྲས་བུ་མངོན་སུམ་དུ་བྱ་བའི་ཕྱིར་ཞུགས་པ་དག་ཀྱང་ཡོད།
en: In the Saṅgha, there are those who practice to directly realize the result of arhat­hood.

source: དགེ་འདུན་གྱི་ནང་ན་དགྲ་བཅོམ་པ་དག་ཀྱང་ཡོད་དེ།
en: In the Saṅgha, there are the arhats:

source: འདི་ལྟ་སྟེ། སྐྱེས་བུ་ཟུང་བཞི། སྐྱེས་བུ་གང་ཟག་ཡ་བརྒྱད་དོ།
en: there are the four pairs of persons, or eight types of persons.

source: །བཅོམ་ལྡན་འདས་ཀྱི་ཉན་ཐོས་ཀྱི་དགེ་འདུན་ནི་འདི་ལྟ་བུ་སྟེ། དད་པ་ཕུན་སུམ་ཚོགས་པ། ཚུལ་ཁྲིམས་ཕུན་སུམ་ཚོགས་པ། ཐོས་པ་ཕུན་སུམ་ཚོགས་པ། ཏིང་ངེ་འཛིན་ཕུན་སུམ་ཚོགས་པ། ཤེས་རབ་ཕུན་སུམ་ཚོགས་པ། རྣམ་པར་གྲོལ་བ་ཕུན་སུམ་ཚོགས་པ། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་ཕུན་སུམ་ཚོགས་པ།
en: The Bhagavat’s Saṅgha of śrāvakas is endowed with faith, endowed with discipline, endowed with aural learning, endowed with samādhi, endowed with wisdom, endowed with liberation, and endowed with the vision of awareness of liberation.

source: ཀུན་ཏུ་སྦྱིན་པའི་འོས་སུ་གྱུར་པ། རབ་ཏུ་སྦྱིན་པའི་འོས་སུ་གྱུར་པ།
en: It is worthy of oblations, and it is worthy of higher oblations.

source: ཐལ་མོ་སྦྱར་བའི་འོས་སུ་གྱུར་པ།
en: One should fold one’s hands in front of it and act properly toward it;

source: ཕྱག་བྱ་བའི་འོས་སུ་གྱུར་པ། བསོད་ནམས་ཀྱི་ཞིང་བླ་ན་མེད་པ་སྟེ། འཇིག་རྟེན་གྱི་སྦྱིན་གནས་ཡིན་ནོ་ཞེས་དགེ་འདུན་ལ་ཤེས་ནས་དད་པ་དང་ལྡན་པ་ཡིན།
en: it is the unexcelled field of merit, worthy of the offerings of the world.

source: འཕགས་པ་བཞེད་པའི་ཚུལ་ཁྲིམས་རྣམས་དང་ལྡན་པ་ཡིན་ཏེ། ཚུལ་ཁྲིམས་དེ་དག་ནི་མ་ཉམས་པ། མ་ཞིག་པ། མ་རལ་པ།
en: “He is endowed with the types of discipline that are highly valued by the noble ones.

source: འདྲེན་མར་མ་གྱུར་པ། སྲ་བསྲེར་མ་ཡིན་པ། རང་དབང་ཅན་མ་འབགས་པ། ཤིན་ཏུ་རྫོགས་པ། མཁས་པས་བསྔགས་པ་མཁས་པ་དག་གིས་མ་སྨད་པ་དག་སྟེ།
en: And as for those types of discipline, they are unimpaired, unbroken, whole, unadulterated, unalloyed, not violated, well completed, praised by the wise, and not reproached by the wise.

source: འདི་དག་ནི་རྒྱུན་དུ་ཞུགས་པའི་ཡན་ལག་བཞིའོ།
en: These are the four parts of entering the stream.

source: །དགེ་སློང་དག་དེ་ལ་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་གང་ཞེ་ན།
en: “Now, bhikṣus, what are the ten strengths of the Tathāgata?

source: དགེ་སློང་དག་དེ་ལ་དེ་བཞིན་གཤེགས་པ་ནི་གནས་ལ་ཡང་གནས་སུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅིང་། གནས་མ་ཡིན་པ་ལ་ཡང་གནས་མ་ཡིན་པར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “Here, bhikṣus, the Tathāgata perfectly cognizes, as it is, what is the case as being the case, and what is not the case as not being the case.

source: འདི་ནི་དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་པོའོ།
en: This is the first strength of the Tathāgata.

source: །འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་ལས་ཡང་དག་ཏྲ་པར་འཛིན་པ་དང་། རྣམ་པར་སྨིན་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ།
en: “He perfectly cognizes, as it is, the taking up and maturation of different types of karma in the past, future, and present.

source: །སེམས་ཅན་ཕ་རོལ་མོས་པ་དུ་མ་ཅན་དག་གི་མོས་པ་སྣ་ཚོགས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ།
en: “He perfectly cognizes, as they are, the different, manifold inclinations of other sentient beings.

source: །ཁམས་དུ་མ་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་ཁམས་སྣ་ཚོགས་ཅན་དུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ།
en: “He perfectly cognizes, as they are, the many, varied basic natures of the world.

source: །སེམས་ཅན་གཞན་དག་གི་དབང་པོ་མཆོག་དང་། མཆོག་མ་ཡིན་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ།
en: “He perfectly cognizes, as they are, the higher and lower faculties of other sentient beings.

source: །ཐམས་ཅད་དུ་འགྲོ་བའི་ལམ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ།
en: “He perfectly cognizes, as they are, the paths that reach everywhere.

source: །སེམས་ཅན་གཞན་དག་གི་དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་རྣམས་ཀྱི་ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་བ་རྣམ་པར་གཞག་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ།
en: “He perfectly cognizes, as it is, the condition of either defilement or purification in other sentient beings’ faculties, strengths, parts of awakening, meditations, liberations, samādhis, and attainments.

source: ཡུལ་ཕྱོགས་དང་བཅས། རྒྱུ་ཅི་ལས་གྱུར་པ་དང་བཅས་པར་སྔོན་གྱི་གནས་རྣམ་པ་དུ་མ་རྗེས་སུ་དྲན་ཏེ།
en: “He remembers many previous lives, including their specific aspects, locations, and causes.

source: སྐྱེ་བ་གཅིག་ཀྱང་རྗེས་སུ་དྲན་ནོ།
en: He remembers one life;

source: །གཉིས་དང་གསུམ་དང་བཞི་ནས་སྐྱེ་བ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་རྗེས་སུ་དྲན་ནོ་ཞེས་རྒྱ་ཆེར་སྦྱར་རོ།
en: he remembers two, three, four, and even up to many hundreds of thousands of millions of crores of lives, and so forth.

source: །ལྷའི་མིག་རྣམ་པར་དག་པ་མི་ལས་འདས་པས་སེམས་སྐྱེ་བ་དང་། ལུས་དང་ངག་དང་ཡིད་ཀྱིས་ལེགས་པར་སྤྱད་པ་དང་། ཉེས་པར་སྤྱད་པ་དག་གིས་བདེ་འགྲོ་དང་། ངན་འགྲོ་རྣམས་སུ་སྐྱེ་བ་དག་གི་སེམས་ཅན་གཟིགས་སོ་ཞེས་རྒྱ་ཆེར་སྦྱར་རོ།
en: “With his divine eye that is pure and beyond that of humans he sees sentient beings as they are born , as they are born in good or bad destinations according to the good or bad deeds of their body, speech, and mind, and so forth.

source: །ཡང་དག་པའི་ཤེས་རབ་ཀྱིས་ཟག་པ་རྣམས་ཟད་ནས་ཟག་པ་ལས་སེམས་རྣམ་པར་གྲོལ་བ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “Through his wisdom he perfectly cognizes, as it is, the mind’s liberation without fluxes, which comes from the destruction of the fluxes.

source: དགེ་སློང་དག་འདི་དག་ནི་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུའོ།
en: “These, bhikṣus, are the ten strengths of the Tathāgata.

source: །དེ་ལ་དེ་བཞིན་གཤེགས་པའི་མི་འཇིགས་པ་བཞི་གང་ཞེ་ན།
en: “Now, what are the four confidences of the Tathāgata?

source: འདི་ལ་བཅོམ་ལྡན་འདས་ཀྱིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སོ་ཞེས་བདག་ཉིད་ཞལ་གྱིས་འཆེ་བ་ལ་འདིར་ལྷ་དང་བཅས་པ་དང་བདུད་དང་བཅས་པ་དང་ཚངས་པ་དང་བཅས་པ་དང་། དགེ་སྦྱོང་དང་བྲམ་ཟེར་བཅས་པ་དང་། ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་སྐྱེ་དགུ་ལས་གང་གིས་ཀྱང་ཁྱོད་ཀྱིས་ཆོས་འདི་དག་མངོན་པར་རྫོགས་པར་སངས་མ་རྒྱས་སོ་ཞེས་དེ་ལ་རྒོལ་བའི་མཚན་མ་དེ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: “In this world, the Bhagavat acknowledges himself as the perfect, complete Buddha. If in this world with its gods, māras, and brahmas, or among the beings including the śramaṇas, brahmins, gods, humans, and asuras, someone were to tell him ‘You have not realized these dharmas,’ he would see no ground for their statement.

source: །དེ་བཞིན་གཤེགས་པས་མཚན་མ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བས་བདེ་བ་ཐོབ་ཅིང་མི་འཇིགས་པ་ཐོབ་པར་གནས་ཤིང་ཁྱུ་མཆོག་གི་གནས་སུ་དམ་བཅས་ཏེ།
en: Not seeing any ground for it, the Tathāgata abides at ease and fearless. He knows well his place as supreme.

source: འཁོར་གྱི་ནང་དུ་སོང་ནས་སེང་གེའི་སྒྲ་ཡང་དག་པར་སྒྲོག་ཅིང་དགེ་སྦྱོང་ངམ།
en: When in the assembly, he rightly roars the lion’s roar.

source: བྲམ་ཟེའམ་སུས་ཀྱང་ཆོས་དང་འཐུན་པར་འཇིག་རྟེན་དུ་མ་བསྐོར་བའི་ཚངས་པའི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་བ་དང་། ཡང་གང་དག་དེ་བཞིན་གཤེགས་པས་བར་དུ་གཅོད་པའི་ཆོས་སུ་གསུངས་པ་དེ་དག་བསྟེན་ཀྱང་བར་དུ་གཅོད་པར་མི་འགྱུར་རོ་ཞེས་འདིར་དེ་ལ་ཞེས་བྱ་བར་རྒྱས་པར་སྦྱར་བ་དང་། གང་ཡང་འདིས་འཕགས་པ་ངེས་པར་འབྱུང་བའི་ལམ་བསྟེན་པ་དེ་དག་བསྟན་པ་དེ་བསྟེན་ཀྱང་སྡུག་བསྔལ་ཡང་དག་པར་ཟད་པར་བྱ་བའི་ཕྱིར་ངེས་པར་འབྱུང་བ་མ་ཡིན་ནོ།
en: He turns the Brahma wheel, not turned in the world by any śramaṇa or brahmin or by anyone else, in accordance with the Dharma. . “As for those dharmas that he declared to be obstacles, if someone were to tell him that ‘For someone who practices them, they are not obstacles,’ it would then be as above. 3. “Moreover, as for the path that he declared to be noble and leading to the final exit, if someone were to say that ‘For someone who practices it, it is not the final exit that brings the right destruction of suffering for someone who enacts it,’ it would then be as above.

source: །ཞེས་གང་ཡང་འདིར་དེ་ལ་ཞེས་བྱ་བར་རྒྱས་པར་སྦྱར་བ་དང་། ང་ཟག་པ་ཟད་དོ་ཞེས་བདག་ཉིད་ཞལ་གྱིས་འཆེ་བ་ལ་འདིར་ལྷ་དང་བཅས་པ་དང་། བདུད་དང་བཅས་པ་དང་ཚངས་པ་དང་བཅས་པའི་འཇིག་རྟེན་དང་། དགེ་སྦྱོང་དང་བྲམ་ཟེར་བཅས་པ་དང་ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་སྐྱེ་དགུ་ལས་གང་གིས་ཀྱང་ཟག་པ་འདི་དག་ཡོངས་སུ་མ་ཟད་དོ་ཞེས་དེ་ལ་རྒོལ་བའི་མཚན་མ་དེ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: “He is one whose fluxes are destroyed, and he acknowledges himself to be so: thus, if in this world with its gods, māras, brahmas, or among the beings including the śramaṇas, brahmins, gods, humans, and asuras, someone were to say that ‘These fluxes of yours are not destroyed,’ he would see no ground for that statement.

source: འཁོར་གྱི་ནང་དུ་སོང་ནས་སེང་གེའི་སྒྲ་ཡང་དག་པར་སྒྲོག་ཅིང་དགེ་སྦྱོང་དང་བྲམ་ཟེའམ།
en: When in the assembly, he rightly roars the lion’s roar.

source: སུས་ཀྱང་ཆོས་དང་འཐུན་པར་འཇིག་རྟེན་དུ་མ་བསྐོར་བའི་ཚངས་པའི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་བ་སྟེ།
en: He turns the Brahma wheel, not turned in the world by any śramaṇa or brahmin or by anyone else, in accordance with the Dharma.

source: འདི་དག་ནི་མི་འཇིགས་པ་བཞིའོ།
en: “These are the four confidences.

source: །དེ་ལ་དེ་བཞིན་གཤེགས་པའི་སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་གང་ཞེ་ན།
en: “Then, what are the Tathāgata’s four special knowledges?

source: འདི་ལྟ་སྟེ། དོན་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། ཆོས་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། ངེས་པའི་ཚིག་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སྤོབས་པ་སོ་སོ་ཡང་དག་པར་རིག་པ་སྟེ། འདི་དག་ནི་སོ་སོ་ཡང་དག་པར་རིག་པ་བཞིའོ།
en: They are the special knowledge of meaning, the special knowledge of dharmas, the special knowledge of explanations, and the special knowledge of brilliancy. These are the four special knowledges.

source: །དེ་ལ་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅོ་བརྒྱད་གང་ཞེ་ན།
en: “Then, what are the eighteen dharmas exclusive to a buddha? “ For a tathāgata, there is no error; there is no yelling; there is no forgetfulness; there is no unconcentrated mind; there is no perception of difference; there is no indifference due to lack of discrimination; there is no loss of zeal; there is no loss of heroism; there is no loss of mindfulness; there is no loss of samādhi; there is no loss of wisdom; there is no loss of liberation;

source: དེ་བཞིན་གཤེགས་པ་ལ་འཁྲུལ་པ་མེད་པ་དང་། ཅ་ཅོ་མེད་པ་དང་། བསྙེལ་བ་མེད་པ་དང་། སེམས་མཉམ་པར་མ་བཞག་པ་མེད་པ་དང་། ཐ་དད་པའི་འདུ་ཤེས་མེད་པ་དང་། སོ་སོར་མ་བརྟགས་པའི་བཏང་སྙོམས་མེད་པ་དང་། འདུན་པ་ཉམས་པ་མེད་པ་དང་། བརྩོན་འགྲུས་ཉམས་པ་མེད་པ་དང་། དྲན་པ་ཉམས་པ་མེད་པ་དང་། ཏིང་ངེ་འཛིན་ཉམས་པ་མེད་པ་དང་། ཤེས་རབ་ཉམས་པ་མེད་པ་དང་། རྣམ་པར་གྲོལ་བ་ཉམས་པ་མེད་པ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་ཉམས་པ་མེད་པ་དང་། འདས་པའི་དུས་ལ་ཡེ་ཤེས་མཐོང་བ་ཆགས་པ་མེད་ཅིང་ཐོགས་པ་མེད་པ་དང་། མ་འོངས་པའི་དུས་ལ་ཡེ་ཤེས་མཐོང་བ་ཆགས་པ་མེད་ཅིང་ཐོགས་པ་མེད་པ་དང་། ད་ལྟར་བྱུང་བའི་དུས་ལ་ཡེ་ཤེས་མཐོང་བ་ཆགས་པ་མེད་ཅིང་ཐོགས་པ་མེད་པ་དང་། ལུས་ཀྱི་ལས་ཐམས་ཅད་ཡེ་ཤེས་སྔོན་དུ་འགྲོ་ཞིང་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། ངག་གི་ལས་ཐམས་ཅད་ཡེ་ཤེས་སྔོན་དུ་འགྲོ་ཞིང་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། ཡིད་ཀྱི་ལས་ཐམས་ཅད་ཡེ་ཤེས་སྔོན་དུ་འགྲོ་ཞིང་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་སྟེ།
en: there is no loss in the vision of awareness of liberation; (13) with respect to the past, his vision of awareness is neither stuck nor obstructed; (14) with respect to the future, his vision of awareness is neither stuck nor obstructed; (15) with respect to the present, his vision of awareness is neither stuck nor obstructed; (16) all his bodily activities are preceded by awareness and follow awareness; (17) all his verbal activities are preceded by awareness and follow awareness; and (18) all his mental activities are preceded by awareness and follow awareness.

source: འདི་དག་ནི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅོ་བརྒྱད་དོ།
en: These are the eighteen dharmas exclusive to a buddha.

source: །དེ་ལ་དེ་བཞིན་གཤེགས་པའི་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་གང་ཞེ་ན།
en: “Then, what are the Tathāgata’s thirty-two marks of a great person?
